In [392]:
#laibraries import
import pandas as pd #Data manipulation
import re
import string  #Remove punctuation & characters
import nltk #Natural language processing 

from nltk.corpus import stopwords  #Stop word removal
from nltk.tokenize import word_tokenize  #Tokenizition
from nltk.stem import PorterStemmer  #Stemming
#علشان اتأكد من تحميل الموارد المطلوبة
nltk.download('punkt')

[nltk_data] Downloading package punkt to
[nltk_data]     C:\Users\hp\AppData\Roaming\nltk_data...
[nltk_data]   Package punkt is already up-to-date!

True

In [393]:
#read the fiel
data = pd.read_excel(r'C:\Users\hp\Desktop\‏‏‏‏BBC news 3.xlsx')

In [394]:
#show data
data.head()

   value       category                                               text
0      2       politics  mutant BOOKS????       ? wins guardian prize a...
1      3          sport  running around the olympics it was back to off...
2      1  entertainment  parker misses england clash tom shanklin will ...
3      1  entertainment  munster cup tie switched to spain munster s he...
4      4           tech  cyber crime booms in 2004 the last 12 months h...

In [395]:
#تحويل الحروف الكبيرة الى صغيرة
data['text'] = data ['text'].str.lower()

In [396]:
data.head()

   value       category                                               text
0      2       politics  mutant books????       ? wins guardian prize a...
1      3          sport  running around the olympics it was back to off...
2      1  entertainment  parker misses england clash tom shanklin will ...
3      1  entertainment  munster cup tie switched to spain munster s he...
4      4           tech  cyber crime booms in 2004 the last 12 months h...

In [397]:
#ازالة علامات الترقيم من النص
data['text']= data['text'].str.replace(f'[{string.punctuation}]', '', regex=True)

In [398]:
data.head()

   value       category                                               text
0      2       politics  mutant books        wins guardian prize a book...
1      3          sport  running around the olympics it was back to off...
2      1  entertainment  parker misses england clash tom shanklin will ...
3      1  entertainment  munster cup tie switched to spain munster s he...
4      4           tech  cyber crime booms in 2004 the last 12 months h...

In [399]:
#ازالة المسافات الزائدة على عمود محدد
data['text'] = data['text'].str.strip()

In [400]:
data.head()

   value       category                                               text
0      2       politics  mutant books        wins guardian prize a book...
1      3          sport  running around the olympics it was back to off...
2      1  entertainment  parker misses england clash tom shanklin will ...
3      1  entertainment  munster cup tie switched to spain munster s he...
4      4           tech  cyber crime booms in 2004 the last 12 months h...

In [401]:
#ازالة الاحرف الغير مرغوب بها
def remove_unwanted_characters(text):
    return re.sub(r'[^a-zA-Z0-9\s]', '', text)

In [402]:
data ['text'] = data['text'].apply(remove_unwanted_characters)

In [403]:
data.head()

   value       category                                               text
0      2       politics  mutant books        wins guardian prize a book...
1      3          sport  running around the olympics it was back to off...
2      1  entertainment  parker misses england clash tom shanklin will ...
3      1  entertainment  munster cup tie switched to spain munster s he...
4      4           tech  cyber crime booms in 2004 the last 12 months h...

In [404]:
#Stemming
#تهيئة  
stemmer = PorterStemmer()

#Function 
def stem_words(text):
    return ' '.join(stemmer.stem(word) for word in nltk.word_tokenize(text))

# تنفيذ الـ stemming على عمود tokens
data['text'] = data['text'].apply(stem_words)

In [405]:
data.head()

   value       category                                               text
0      2       politics  mutant book win guardian prize a book about th...
1      3          sport  run around the olymp it wa back to offici duti...
2      1  entertainment  parker miss england clash tom shanklin will st...
3      1  entertainment  munster cup tie switch to spain munster s hein...
4      4           tech  cyber crime boom in 2004 the last 12 month hav...

In [406]:
#تطبيق tokenization على عمود محدد
data['tokens'] = data['text'].apply(word_tokenize)

In [407]:
data.head()

,value,category,text,tokens
0,2,politics,mutant book win guardian prize a book about th...,"[mutant, book, win, guardian, prize, a, book, ..."
1,3,sport,run around the olymp it wa back to offici duti...,"[run, around, the, olymp, it, wa, back, to, of..."
2,1,entertainment,parker miss england clash tom shanklin will st...,"[parker, miss, england, clash, tom, shanklin, ..."
3,1,entertainment,munster cup tie switch to spain munster s hein...,"[munster, cup, tie, switch, to, spain, munster..."
4,4,tech,cyber crime boom in 2004 the last 12 month hav...,"[cyber, crime, boom, in, 2004, the, last, 12, ..."

In [408]:
#تحديد stop words للغة الانجليزية
stop_words = set(stopwords.words('english'))

#ازالة stop words
def remove_stop_words(tokens):
    return [word for word in tokens if word not in stop_words]

#تنفيذ الـ fanction على عمود tokens
data['tokens'] = data['tokens'].apply(remove_stop_words)

In [428]:
data.head()

,value,category,text,tokens
0,2,politics,mutant book win guardian prize a book about th...,"[mutant, book, win, guardian, prize, book, evo..."
1,3,sport,run around the olymp it wa back to offici duti...,"[run, around, olymp, wa, back, offici, duti, l..."
2,1,entertainment,parker miss england clash tom shanklin will st...,"[parker, miss, england, clash, tom, shanklin, ..."
3,1,entertainment,munster cup tie switch to spain munster s hein...,"[munster, cup, tie, switch, spain, munster, he..."
4,4,tech,cyber crime boom in 2004 the last 12 month hav...,"[cyber, crime, boom, 2004, last, 12, month, se..."

In [430]:
data.to_excel('C:\\Users\\hp\\Desktop\\‏‏‏‏BBC news 3.xlsx', index=False)